/// * 📄[AppStrings] centralized place for all app text constants.
//
abstract final class AppStrings {
  ///-------------------------
  const AppStrings._();

  ///
  /// ===============================
  /// * 🏠 App Titles
  // ===============================
  // static const String appTitle = 'Firebase with BLoC/Cubit';
  // static const String changePasswordPageTitle = 'Change Password';
  // static const String resetPasswordPageTitle = 'Reset Password';
  // static const String verifyEmailPageTitle = 'Verify Email';

  /// ────────────────────────────────────────────────────────────────────
  /// * 🏠 Titles
  // ────────────────────────────────────────────────────────────────────
  // static const String homePageTitle = '     Home Page';
  // static const String profilePageTitle = 'Profile';

  /// ────────────────────────────────────────────────────────────────────
  /// * 🆗 Buttons texts
  // ────────────────────────────────────────────────────────────────────
  // static const String okButton = 'OK';
  // static const String signUpButton = 'Sign Up';
  // static const String redirectToSignIn = 'Already a member? Sign In!';
  // static const String signInButton = 'Sign In';
  // static const String redirectToSignUp = 'Not a member? Sign Up!';

  /// ────────────────────────────────────────────────────────────────────
  /// * 🌗 Theme Mode Messages
  // ────────────────────────────────────────────────────────────────────
  // static const String lightModeEnabled = 'now is  "Light Mode"';
  // static const String darkModeEnabled = 'now is  "Dark Mode"';

  /// ────────────────────────────────────────────────────────────────────
  /// * ❌ Error / Not Found
  // ────────────────────────────────────────────────────────────────────
  // static const String pageNotFoundTitle = 'Page Not Found';
  // static const String pageNotFoundMessage =
  //     'Oops! The page you’re looking for does not exist.';
  // static const String goToHomeButton = 'To Home Page';

  /// ────────────────────────────────────────────────────────────────────
  /// * 🧠 Info / Slogans
  // ────────────────────────────────────────────────────────────────────
  // static const String blocSlogan =
  //     'Bloc is an awesome\nstate management library\nfor Flutter!';

  /// ────────────────────────────────────────────────────────────────────
  /// * 🧠 Form fields labels
  // ────────────────────────────────────────────────────────────────────
  // static const String name = 'Name';
  // static const String email = 'Email';
  // static const String password = 'Password';
  // static const String confirmPassword = 'Confirm Password';

  /// ────────────────────────────────────────────────────────────────────
  /// * 🔍 PROFILE PAGE
  // ────────────────────────────────────────────────────────────────────
  // static const String profileNameLabel = '👤 Name:';
  // static const String profileIdLabel = '🆔 ID:';
  // static const String profileEmailLabel = '📧 Email:';
  // static const String profilePointsLabel = '📊 Points:';
  // static const String profileRankLabel = '🏆 Rank:';
  // static const String profileErrorMessage = 'Oops!\nSomething went wrong.';

  /// ────────────────────────────────────────────────────────────────────
  /// * 🔍 OTHERS
  // ────────────────────────────────────────────────────────────────────

  ///
}
