import 'package:flutter/material.dart';

part 'app_colors.dart';
part 'app_spacing.dart';
part 'app_icons.dart';

/// * [UIConstants]- centralized place for static constants.
abstract class UIConstants {
  ///
  /// ────────────────────────────────────────────────────────────────────
  /// * 📏 Common UI Constants
  // ────────────────────────────────────────────────────────────────────
  static const BorderRadius commonBorderRadius = BorderRadius.all(
    Radius.circular(12),
  );

  /// * 🔳 size Factors
  static const double sizeF08 = 0.8;

  /// ────────────────────────────────────────────────────────────────────
  /// * 🔥 OTHER
  // ────────────────────────────────────────────────────────────────────

  ///
}
