/// * 📄[AppStrings] centralized place for all app text constants.
abstract class AppStrings {
  ///
  /// ===============================
  /// * 🏠 App Titles
  // ===============================
  static const String appTitle = 'Firebase with BLoC/Cubit';
  static const String changePasswordPageTitle = 'Change Password';
  static const String resetPasswordPageTitle = 'Reset Password';
  static const String verifyEmailPageTitle = 'Verify Email';

  /// ────────────────────────────────────────────────────────────────────
  /// * 🏠 Titles
  // ────────────────────────────────────────────────────────────────────
  static const String homePageTitle = '     Home Page';

  /// ────────────────────────────────────────────────────────────────────
  /// * 🆗 Buttons texts
  // ────────────────────────────────────────────────────────────────────
  static const String okButton = 'OK';

  /// ────────────────────────────────────────────────────────────────────
  /// * 🌗 Theme Mode Messages
  // ────────────────────────────────────────────────────────────────────
  static const String lightModeEnabled = 'now is  "Light Mode"';
  static const String darkModeEnabled = 'now is  "Dark Mode"';

  /// ────────────────────────────────────────────────────────────────────
  /// * ❌ Error / Not Found
  // ────────────────────────────────────────────────────────────────────
  static const String pageNotFoundTitle = 'Page Not Found';
  static const String pageNotFoundMessage =
      'Oops! The page you’re looking for does not exist.';
  static const String goToHomeButton = 'To Home Page';

  /// ────────────────────────────────────────────────────────────────────
  /// * 🧠 Info / Slogans
  // ────────────────────────────────────────────────────────────────────
  static const String blocSlogan =
      'Bloc is an awesome\nstate management library\nfor Flutter!';

  /// ────────────────────────────────────────────────────────────────────
  /// * 🧠 Form fields labels
  // ────────────────────────────────────────────────────────────────────
  static const String name = 'Name';
  static const String email = 'Email';
  static const String password = 'Password';
  static const String confirmPassword = 'Confirm Password';

  /// ────────────────────────────────────────────────────────────────────
  /// * 🔍 **OTHERS**
  // ────────────────────────────────────────────────────────────────────

  ///
}
