/// 📄 **AppStrings** — Centralized place for all app text constants.
/// Improves maintainability and localization readiness.
abstract class AppStrings {
  ///
  // ===============================
  // 🏠 App Titles
  // ===============================

  static const String appTitle = 'Firebase with BLoC/Cubit';
  static const String toggleTheme = 'Toggle Theme';

  // ────────────────────────────────────────────────────────────────────
  // 🏠 **Titles**
  // ────────────────────────────────────────────────────────────────────
  static const String homePageTitle = '     Home Page';

  // ────────────────────────────────────────────────────────────────────
  // 🆗 **Buttons**
  // ────────────────────────────────────────────────────────────────────
  static const String okButton = 'OK';

  // ────────────────────────────────────────────────────────────────────
  // 🌗 **Theme Mode Messages**
  // ────────────────────────────────────────────────────────────────────
  static const String lightModeEnabled = 'now is  "Light Mode"';
  static const String darkModeEnabled = 'now is  "Dark Mode"';

  // ────────────────────────────────────────────────────────────────────
  // 🔍 **OTHERS**
  // ────────────────────────────────────────────────────────────────────

  ///
}
