/// * 📄[AppStrings] centralized place for all app text constants.
abstract class AppStrings {
  ///
  /// ===============================
  /// * 🏠 App Titles
  // ===============================
  static const String appTitle = 'Firebase with BLoC/Cubit';
  static const String changePasswordPageTitle = 'Change Password';
  static const String resetPasswordPageTitle = 'Reset Password';
  static const String verifyEmailPageTitle = 'Verify Email';

  /// ────────────────────────────────────────────────────────────────────
  /// * 🏠 Titles
  // ────────────────────────────────────────────────────────────────────
  static const String homePageTitle = '     Home Page';

  /// ────────────────────────────────────────────────────────────────────
  /// * 🆗 Buttons texts
  // ────────────────────────────────────────────────────────────────────
  static const String okButton = 'OK';

  /// ────────────────────────────────────────────────────────────────────
  /// * 🌗 Theme Mode Messages
  // ────────────────────────────────────────────────────────────────────
  static const String lightModeEnabled = 'now is  "Light Mode"';
  static const String darkModeEnabled = 'now is  "Dark Mode"';

  /// ────────────────────────────────────────────────────────────────────
  /// * 🔍 **OTHERS**
  // ────────────────────────────────────────────────────────────────────

  ///
}
